Tekla Open API Reference for Tekla Structures 2025
AnalysisSubSection.Type Property
 The type of the subsection.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisSubSection.AnalysisSubSectionTypeEnum Type { get; set; }
Public Property Type As AnalysisSubSection.AnalysisSubSectionTypeEnum
	Get
	Set
Property Value
Type: AnalysisSubSection.AnalysisSubSectionTypeEnum
See Also
Reference
AnalysisSubSection Class
Tekla.Structures.Analysis Namespace